const messages = {
  DESCRIPTION1:
    "لطفا اگر ایشون رو پسندیدید و شرایطش رو دارید به ربات زیر رفته و پس از استارت گزینه جستجو رو انتخاب کنید و بعد کد پست که بفرستید",
  DESCRIPTION2:
    "اگر شما هم میخواهید مثل ایشون مشخصاتتون رو تو کانال پست کنید تا هر کسی شرایط شما رو داشت و بهتون میخورد با شما ارتباط بگیره به ربات زیر رفته و پس از استارت گزینه ایجاد فرم رو بزنید",
  FORM_TYPE_QUESTION:
    "لطفا نوع فرم خود را بدون فاصله وارد کنید؟(شوگرمامی یا شوگرددی یا شوگربیبی)",
  FORM_NAME_QUESTION: "لطفا نام خود را وارد کنید؟",
  FORM_GENDER_QUESTION: "لطفا جنسیت خود را وارد کنید؟ ",
  FORM_AGE_QUESTION: "لطفا سن خود را وارد کنید؟",
  FORM_EDUCATION_QUESTION: "لطفا تحصیلات خود را وارد کنید؟",
  FORM_JOB_QUESTION: "لطفا شغل خود را وارد کنید؟",
  FORM_SALARY_QUESTION: "لطفا میزان درآمد خود را وارد کنید؟",
  FORM_HEIGHT_QUESTION: "لطفا قد خود را وارد کنید؟",
  FORM_WEIGHT_QUESTION: "لطفا وزن خود را وارد کنید؟",
  FORM_CITY_QUESTION: "لطفا شهر خود را وارد کنید؟",
  FORM_CONDITIONS_QUESTION: "لطفا شرایط خود را وارد کنید؟",
  FORM_SUCCESS_MESSAGE:
    "فرم شما با موفقیت ثبت شد و حداقل 2 و حداکثر 5 ساعت دیگر در کانال پست خواهد شد",
  FORM_ERROR_MESSAGE: "فرم ثبت نشد!!",
  FORM_VALID_MESSAGE: "آیا اطلاعات فرم مورد تایید است؟",
  FORM_AGE_VALID_MESSAGE: "سن را به صورت عدد وارد کنید",
  FORM_AGE_VALID_MESSAGE_2: "سن باید بین 18 تا 100 سال باشد",
  FORM_CODE_QUESTION: "لطفا کد پست را وارد کنید؟",
  SEARCH_FORM_NOT_FOUND: "فرم یافت نشد",
  SEARCH_FORM_NOT_FOUND_2: "هیج فرمی یافت نشد",
  MESSAGE_RECEIVED_FROM_USER: "پیام دریافت شده از کاربر",
  MESSAGE_REPLY_TO_USER:
    "تو هم میتونی با ریپلای کردن این پیام به این شخص جواب بدی 😊",
  MESSAGE_SUCCESS_SEND: "✅ پیام شما با موفقیت ارسال شد.",
  MESSAGE_ERROR_SEND: "❌ پیام شما ارسال نشد.",
  MESSAGE_REPLY_TO_SEND_MESSAGE:
    "برای ارسال پیام به کاربر از ریپلای کردن این پیام استفاده کنید",
  MESSAGE_ONLY_TEXT_MESSAGE: "فقط میتونی پیام با فرمت متنی ارسال کنی",
  MESSAGE_CREATE_CONNECTION:
    "ارتباط با کاربر برای ارسال پیام ایجاد شد. فقط میتوانید متن یا عکس را ارسال کنید",
  MESSAGE_DO_YOU_LIKE_TO_SEND_MESSAGE:
    "آیا میخوای به این کاربر پیام ارسال کنی؟",
  MESSAGE_IN_BLACKLISTED:
    " ارتباط بین شما و این کاربر توسط یکی از شما مسدود شده است",
  MESSAGE_DELETE_FORM:
    "هر فرد فقط مجاز به ثبت یک فرم میباشد، شما می توانید با حذف فرم قبلی دوباره فرم خود را ثبت کنید. آیا میخواهید فرم خود حذف کنید؟",
  MESSAGE_DELETE_FORM_SUCCESS: "فرم شما با موفقیت حذف شد",
  FORM_VALIDATE_GENDER_ERROR:
    "جنسیت نامعتبر است! جنسیت باید یکی از مقادیر 'مرد' یا 'زن' یا 'سفارشی' باشد.",
  FORM_VALIDATE_AGE_ERROR: "لطفا سن را به عدد وارد کنید",
  FORM_VALIDATE_AGE_MIN_MAX_ERROR: "سن باید بین 18 تا 100 سال باشد",
  FORM_VALIDATE_EDUCATION_ERROR:
    "درجه تحصیلی نامعتبر است! درجه تحصیلی باید یکی از مقادیر 'دیپلم' یا 'فوق دیپلم' یا 'کارشناسی' یا 'کارشناسی ارشد' یا 'دکترا' یا 'سایر' باشد.",
  MESSAGE_ONLY_TEXT_AND_IMAGE: "فقط میتونی پیام با فرمت متنی یا عکس ارسال کنی",
  FORM_DESC:
    "اگر شرایط ایشون رو دارید میتونین از لینک زیر از طریق ربات باهاشون چت کنید",
  MESSAGE_SEND_PHOTO: "این کاربر برای شما عکس بالا ارسال کرده است",
  FORM_SUCCESS_SEND_IN_CHANNEL: "فرم شما با موفقیت در کانال ارسال شد",
  FORM_DELETE_BEFORE_CONFIRM: "متاسفانه فرم شما توسط ادمین حذف شد.",
  FOR_USE_BOT_JOIN_IN_CHANNEL: "برای استفاده از ربات باید در کانال عضو شوید",
};

export { messages };
